"use client";
import { useState, useRef } from "react";
import { useRouter } from "next/navigation";
import PageInfo from "@/components/PageInfo";

export default function PolicyAgreement() {
  const [showInfo, setShowInfo] = useState(false);
  const checkboxRef = useRef(null);
  const router = useRouter();

  const handleClose = () => setShowInfo(false);
  const handleNextClick = () => {
    if (checkboxRef.current.checked) {
      router.push("/prepare/background-survey");
    } else {
      alert("OPIc 평가 윤리 규정에 동의하셔야 합니다.");
    }
  };
  const pageinfo = {
    title: "Guide",
    descriptions: [
      "* 평가 윤리 규정 안내 화면입니다.",
      "* 모든 준수 사항을 읽고 이해하신 후 아래 체크박스를 선택해 주십시오.",
    ],
    onClose: handleClose,
  };

  const descriptions = [
    {
      subhead:
        "모든 준수 사항을 읽고 이해하셨으면 하단 체크박스를 선택해 주십시오.",
      list: [
        "OPIc ™은 언어 숙달도에 대한 평가로서, 미리 연습하지 않은 즉흥적인 상황에서 자연스럽게 말하는 능력을 평가하는 테스트임을 이해하였습니다.",
        "아무리 정확하고 의사 소통이 잘 된다 하더라도, 암기되거나 반복 연습된 발화만을 지속적으로 생산하는 경우 ‘초급 (Novice)’수준으로 간주될 것임을 이해하였습니다. 위와 같은 경우 평가자는 ‘초급 (Novice)’ 수준 내에서 응시자의 등급을 정하게 될 것입니다.",
      ],
    },
    {
      subhead: "응시자 준수 사항",
      list: [
        "OPIc 응시 중, 시험 질문에 대한 답변은 응시자 본인 스스로의 표현으로 답해야 하며 본인의 말하기와 듣기 능력을 반영해야 한다는 것을 이해하였습니다.",
        "다른 응시자의 콘텐츠를 따라하거나 외워서 사용하는 것은 허용되지 않으며 부정 행위로 간주됨을 이해하였습니다.",
        "시험 중, 다른 사람으로부터 도움을 받을 수 없음을 이해하였습니다. 시험 중, 다른 사람들과의 공동 작업은 허용되지 않으며 부정 행위로 간주됩니다.",
        "시험 중, 노트, 책, 사전, 웹 사이트, 번역기, 휴대폰 또는 기타 전자 기기등의 도움을 받을 수 없음을 이해하였습니다.",
        "OPIc 평가 후, 시험 질문 또는 질문에 대한 본인의 대답을 어떤 이유로든 다른 사람과 공유할 수 없음을 이해하였습니다. OPIc은 ACTFL이 저작권을 갖고 있는 지적 재산입니다.",
      ],
    },
    {
      subhead:
        "불이익: 상기의 규칙을 위반했을 경우, 그에 따른 불이익이 있습니다.",
      list: [
        "부정 행위 적발 시, OPIc 시험은 채점 불가로 기록되고, 시험 결과는 취소될 것임을 이해하였습니다.",
        "고용주 또는 고등 교육 기관을 통해 OPIc 평가가 요청된 경우, 시험 결과가 제 3 자에게 보고될 것이라는 사실을 이해하였습니다.",
        "부정 행위시 최대 5년까지 이 시험에 재응시할 수 없음을 이해하였습니다",
        "OPIc시험 문항을 타인과 공유하거나 ACTFL 저작권 위반 및 지적 재산권 침해 시, 추후 법적 제재가 뒤따를 수 있다는 것을 이해하였습니다.",
        "ACTFL 시험 내용을 타인과 공유하거나 저작권 침해 시, ACTFL 평가에 응시할 수 없거나 ACTFL 평가에서 ACTFL 인증을 받을 수 있는 자격을 영구히 상실한다는 것을 이해하였습니다.",
      ],
    },
  ];

  return (
    <div className="bg-white p-4 w-full">
      <div className="flex justify-end">
        <button
          className="w-6 h-6"
          onClick={() => {
            setShowInfo(true);
          }}
        >
          <svg
            className="fill-slate-500 hover:fill-black"
            xmlns="http://www.w3.org/2000/svg"
            version="1.1"
            id="Layer_1"
            x="0px"
            y="0px"
            viewBox="0 0 122.88 122.88"
          >
            <g>
              <path d="M61.44,9.23c-1.85,0-3.64,0.08-5.35,0.25c-1.71,0.17-3.44,0.42-5.17,0.77c-1.72,0.34-3.39,0.77-5,1.26 c-1.59,0.49-3.16,1.07-4.7,1.72l-0.1,0.05l0,0c-1.63,0.7-3.18,1.45-4.67,2.25c-1.5,0.81-2.94,1.68-4.31,2.6 c-1.38,0.93-2.72,1.92-3.99,2.97c-1.27,1.05-2.5,2.16-3.68,3.35l-0.04,0.04c-1.18,1.18-2.29,2.4-3.33,3.66 c-1.05,1.28-2.04,2.61-2.97,3.99c-0.92,1.36-1.78,2.8-2.59,4.3c-0.8,1.49-1.56,3.05-2.26,4.67l-0.05,0.11l0,0l-0.07,0.14 c-0.63,1.5-1.19,3.04-1.67,4.61c-0.49,1.59-0.9,3.23-1.24,4.93c-0.35,1.73-0.6,3.45-0.77,5.17c-0.17,1.72-0.25,3.5-0.25,5.35 c0,1.85,0.08,3.64,0.25,5.35c0.17,1.71,0.42,3.44,0.77,5.17c0.35,1.72,0.77,3.39,1.27,5c0.49,1.57,1.05,3.13,1.7,4.66 c0.04,0.07,0.07,0.14,0.1,0.21c0.69,1.6,1.43,3.13,2.23,4.6c0.81,1.5,1.68,2.94,2.59,4.3c0.93,1.39,1.92,2.72,2.98,4 c1.02,1.24,2.11,2.44,3.26,3.59c0.07,0.06,0.13,0.12,0.19,0.19c1.16,1.16,2.36,2.24,3.59,3.26c1.28,1.05,2.61,2.04,3.99,2.97 c1.36,0.92,2.8,1.78,4.3,2.59c1.49,0.8,3.05,1.56,4.67,2.26l0.21,0.1c1.52,0.64,3.07,1.2,4.67,1.69c1.58,0.49,3.23,0.9,4.92,1.24 c1.73,0.35,3.45,0.6,5.17,0.77c1.72,0.17,3.5,0.25,5.35,0.25c1.85,0,3.64-0.08,5.35-0.25c1.71-0.17,3.44-0.42,5.17-0.77 c1.72-0.35,3.39-0.77,5-1.27c1.59-0.49,3.16-1.07,4.71-1.73l0.09-0.04l0-0.01c1.63-0.7,3.18-1.45,4.67-2.25 c1.5-0.81,2.94-1.68,4.31-2.6c1.38-0.93,2.72-1.92,3.99-2.97c1.25-1.03,2.45-2.12,3.62-3.29c0.06-0.06,0.11-0.12,0.18-0.18 c1.15-1.15,2.23-2.35,3.25-3.58c1.05-1.28,2.05-2.61,2.98-4c0.92-1.36,1.78-2.8,2.59-4.3c0.8-1.49,1.56-3.04,2.26-4.67l0.1-0.22 c0.64-1.51,1.2-3.06,1.69-4.65c0.49-1.59,0.9-3.23,1.24-4.93c0.35-1.73,0.6-3.45,0.77-5.17c0.17-1.72,0.25-3.5,0.25-5.35 c0-1.85-0.08-3.64-0.25-5.35c-0.17-1.71-0.42-3.44-0.77-5.17c-0.35-1.72-0.77-3.39-1.27-5c-0.49-1.59-1.07-3.16-1.73-4.71 l-0.04-0.09l0,0c-0.7-1.63-1.45-3.18-2.25-4.67c-0.81-1.5-1.68-2.94-2.59-4.3c-0.93-1.38-1.92-2.72-2.97-3.99 c-1.02-1.24-2.12-2.45-3.28-3.61c-0.07-0.06-0.13-0.12-0.18-0.18c-1.16-1.16-2.35-2.24-3.59-3.26c-1.28-1.05-2.61-2.04-3.99-2.97 c-1.37-0.92-2.8-1.78-4.3-2.59c-1.49-0.8-3.04-1.56-4.67-2.25l-0.19-0.09c-1.52-0.64-3.08-1.21-4.68-1.7 c-1.58-0.49-3.23-0.9-4.93-1.24c-1.73-0.35-3.45-0.6-5.17-0.77C65.08,9.31,63.29,9.23,61.44,9.23L61.44,9.23z M63.34,31.17 c2.19,0,3.91,0.63,5.16,1.88c1.24,1.25,1.87,2.96,1.87,5.17c0,2.24-1.07,4.22-3.21,5.97c-2.16,1.74-4.66,2.62-7.52,2.62 c-2.14,0-3.85-0.6-5.16-1.8c-1.31-1.22-1.96-2.79-1.96-4.75c0-2.47,1.07-4.59,3.19-6.4C57.82,32.06,60.37,31.17,63.34,31.17 L63.34,31.17L63.34,31.17z M75.55,91.71H47.33v-4.75h5.3V57.95h-5.3v-3.78h13.19c3.33,0,6.61-0.4,9.85-1.22v34.01h5.18L75.55,91.71 L75.55,91.71L75.55,91.71z M49.12,1.2c1.96-0.39,3.99-0.69,6.08-0.89C57.29,0.1,59.37,0,61.44,0c2.07,0,4.15,0.1,6.24,0.31 c2.09,0.2,4.12,0.5,6.08,0.89c1.94,0.39,3.88,0.88,5.82,1.48c1.88,0.58,3.74,1.26,5.58,2.04l0.19,0.07l0,0l0.06,0.02 c1.85,0.8,3.65,1.67,5.38,2.61c1.71,0.93,3.4,1.95,5.07,3.07c1.63,1.1,3.21,2.27,4.73,3.52c1.52,1.25,2.97,2.56,4.34,3.95 c1.38,1.38,2.7,2.83,3.95,4.34c1.25,1.52,2.42,3.09,3.52,4.73c1.09,1.63,2.11,3.32,3.06,5.06l0,0l0.01,0 c0.94,1.74,1.82,3.54,2.61,5.39c0.02,0.05,0.04,0.1,0.06,0.15c0.78,1.83,1.46,3.7,2.05,5.6c0.61,1.96,1.11,3.92,1.5,5.89 c0.39,1.96,0.69,3.99,0.89,6.08c0.2,2.09,0.3,4.17,0.3,6.24c0,2.07-0.1,4.15-0.31,6.24c-0.2,2.09-0.5,4.12-0.89,6.08 c-0.39,1.94-0.88,3.88-1.48,5.82c-0.58,1.89-1.27,3.76-2.05,5.62l-0.04,0.09l0,0l-0.05,0.11c-0.8,1.85-1.67,3.65-2.61,5.38 c-0.93,1.71-1.95,3.4-3.07,5.07c-1.1,1.63-2.27,3.21-3.52,4.73c-1.25,1.52-2.56,2.96-3.95,4.34c-1.38,1.38-2.83,2.7-4.35,3.95 c-1.52,1.25-3.09,2.42-4.72,3.51c-1.63,1.09-3.32,2.11-5.06,3.06c-1.78,0.96-3.57,1.84-5.39,2.62c-0.05,0.02-0.1,0.04-0.16,0.06 c-1.83,0.78-3.7,1.46-5.6,2.05c-1.96,0.61-3.92,1.11-5.88,1.5c-1.96,0.39-3.99,0.69-6.08,0.89c-2.09,0.2-4.17,0.3-6.24,0.3 s-4.15-0.1-6.24-0.3c-2.09-0.2-4.12-0.5-6.08-0.89c-1.94-0.39-3.88-0.88-5.82-1.48c-1.89-0.58-3.76-1.27-5.61-2.05l-0.2-0.08l0,0 c-1.85-0.8-3.65-1.67-5.38-2.61c-1.71-0.93-3.4-1.95-5.07-3.07c-1.63-1.09-3.21-2.27-4.72-3.51c-1.52-1.25-2.97-2.57-4.35-3.95 c-1.38-1.38-2.7-2.83-3.95-4.34c-1.25-1.52-2.42-3.1-3.52-4.73c-1.09-1.63-2.11-3.32-3.06-5.06c-0.97-1.78-1.84-3.58-2.62-5.4 c-0.02-0.05-0.04-0.1-0.06-0.15c-0.78-1.83-1.46-3.7-2.05-5.6c-0.61-1.96-1.11-3.93-1.5-5.89c-0.39-1.96-0.69-3.99-0.89-6.08 C0.1,65.59,0,63.51,0,61.44c0-2.07,0.1-4.15,0.31-6.24c0.2-2.09,0.5-4.12,0.89-6.08c0.39-1.94,0.88-3.88,1.48-5.82 c0.58-1.88,1.26-3.74,2.04-5.59l0.09-0.23l0,0c0.8-1.85,1.67-3.65,2.61-5.38c0.93-1.71,1.95-3.4,3.07-5.07 c1.1-1.63,2.27-3.21,3.52-4.73c1.25-1.52,2.56-2.96,3.95-4.34c1.38-1.38,2.83-2.7,4.34-3.95c1.52-1.25,3.09-2.42,4.73-3.52 c1.67-1.12,3.36-2.14,5.07-3.07l0.13-0.06c1.73-0.94,3.48-1.78,5.26-2.55c0.05-0.02,0.1-0.04,0.15-0.06 c1.83-0.78,3.7-1.46,5.6-2.05C45.19,2.09,47.15,1.59,49.12,1.2L49.12,1.2z" />
            </g>
          </svg>
        </button>
      </div>
      {showInfo && <PageInfo {...pageinfo} />}
      <main className="m-8">
        <h1 className="text-2xl mb-8 font-bold">ACTFL 평가 윤리 규정</h1>
        <div className="flex-col justify-center items-center text-xs">
          {descriptions.map((desc, index) => (
            <div key={index} className="mb-4 flex flex-col gap-4">
              <h2 className="text-lg font-bold">{desc.subhead}</h2>
              <ul className="list-disc pl-4">
                {desc.list.map((item, index) => (
                  <li className="mb-2" key={index}>
                    {item}
                  </li>
                ))}
              </ul>
            </div>
          ))}
          <label>
            <input type="checkbox" id="agree" name="agree" ref={checkboxRef} />{" "}
            본인은 ACTFL OPIc평가 윤리 규정을 읽고 이해하였음을 확인합니다.
          </label>
          <div className="flex justify-end">
            <button
              className="bg-orange-500 hover:bg-orange-700 text-white font-bold py-2 px-4 rounded focus:outline-none focus:shadow-outline"
              onClick={handleNextClick}
            >
              Next
            </button>
          </div>
        </div>
      </main>
    </div>
  );
}
